---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsShader
source: html/658c0e82-29d0-c69a-8ab6-6bdcfabf3dda.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsShader Property

The property labeled "Image" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodImperfectionsShader { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.